TestCase/DeconvolutionBased/DC_50_DB_NEW/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
4096
(
1.15203
1.15203
1.15203
1.15203
1.15203
1.15203
1.15203
1.15203
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0.654843;
    }
    bottom
    {
        type            calculated;
        value           uniform 1.15203;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.15203
1.13334
1.11484
1.09652
1.07838
1.06042
1.04264
1.02504
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.15203
1.13334
1.11484
1.09652
1.07838
1.06042
1.04264
1.02504
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
